In [2]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\miki_\anaconda3\lib\site-packages (3.0.5)
Requirement already satisfied: jdcal in c:\users\miki_\anaconda3\lib\site-packages (from openpyxl) (1.4.1)
Requirement already satisfied: et-xmlfile in c:\users\miki_\anaconda3\lib\site-packages (from openpyxl) (1.0.1)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

In [4]:
q32016 = "../housingcsv/2016q3.xlsx"
df1 = pd.read_excel(q32016,engine='openpyxl')
refine1 = df1.drop(['Sales\n3Q 2015', 'Median\n3Q 2015', 'Median\nChange'], axis=1)
refine1= refine1.rename(columns={'Sales\n3Q 2016': 'Sales Q3 2016', 'Median\nQ3 2016': 'Median Q3 2016'})
refine1

               City          Suburb  Sales Q3 2016  Median\n3Q 2016
0          ADELAIDE        ADELAIDE            6.0         747500.0
1          ADELAIDE  NORTH ADELAIDE            6.0         932000.0
2    ADELAIDE HILLS         ALDGATE           13.0         665000.0
3    ADELAIDE HILLS          ASHTON            NaN              NaN
4    ADELAIDE HILLS    BASKET RANGE            NaN              NaN
..              ...             ...            ...              ...
473    WEST TORRENS       THEBARTON            2.0         516000.0
474    WEST TORRENS    TORRENSVILLE            6.0         605000.0
475    WEST TORRENS       UNDERDALE            6.0         521500.0
476    WEST TORRENS      WEST BEACH           18.0         660000.0
477    WEST TORRENS   WEST RICHMOND            2.0         468500.0

[478 rows x 4 columns]

In [5]:
q42016 = "../housingcsv/2016q4.xlsx"
df2 = pd.read_excel(q42016,engine='openpyxl')
refine2 = df2.drop(['Sales\n4Q 2015', 'Median\n4Q 2015', 'Median\nChange'], axis=1)
refine2 = refine2.rename(columns={'Sales\n4Q 2016':'Sales Q4 2016', 'Median\n4Q 2016': 'Median Q4 2016'})
refine2

               City          Suburb  Sales Q4 2016  Median Q4 2016
0          ADELAIDE        ADELAIDE            6.0        683000.0
1          ADELAIDE  NORTH ADELAIDE            6.0       1231000.0
2    ADELAIDE HILLS         ALDGATE           10.0        695000.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            NaN             NaN
..              ...             ...            ...             ...
472    WEST TORRENS       THEBARTON            6.0        510000.0
473    WEST TORRENS    TORRENSVILLE           10.0        588000.0
474    WEST TORRENS       UNDERDALE            4.0        567500.0
475    WEST TORRENS      WEST BEACH           11.0        575000.0
476    WEST TORRENS   WEST RICHMOND            8.0        417500.0

[477 rows x 4 columns]

In [6]:
q12017 = "../housingcsv/2017q1.xlsx"
df3 = pd.read_excel(q12017,engine='openpyxl')
refine3 = df3.drop(['Sales\n1Q 2016', 'Median\n1Q 2016', 'Median\nChange'], axis=1)
refine3 = refine3.rename(columns={'Sales\n1Q 2017':'Sales Q1 2017', 'Median\n1Q 2017': 'Median Q1 2017'})
refine3

               City          Suburb  Sales Q1 2017  Median Q1 2017
0          ADELAIDE        ADELAIDE            6.0        627500.0
1          ADELAIDE  NORTH ADELAIDE            6.0        992500.0
2    ADELAIDE HILLS         ALDGATE           14.0        695000.0
3    ADELAIDE HILLS          ASHTON            1.0        415000.0
4    ADELAIDE HILLS    BASKET RANGE            1.0        470000.0
..              ...             ...            ...             ...
473    WEST TORRENS       THEBARTON            3.0        568000.0
474    WEST TORRENS    TORRENSVILLE           12.0        532000.0
475    WEST TORRENS       UNDERDALE            5.0        540000.0
476    WEST TORRENS      WEST BEACH           12.0        670000.0
477    WEST TORRENS   WEST RICHMOND            2.0        419600.0

[478 rows x 4 columns]

In [7]:
q22017 = '../housingcsv/2017q2.xlsx'
df4 = pd.read_excel(q22017,engine='openpyxl')
refine4 = df4.drop(['Sales\n2Q 2016', 'Median\n2Q 2016', 'Median\nChange'], axis=1)
refine4 = refine4.rename(columns={'Sales\n2Q 2017': 'Sales Q2 2017', 'Median\n2Q 2017': 'Median Q2 2017'})
refine4

               City          Suburb  Sales Q2 2017  Median Q2 2017
0          ADELAIDE        ADELAIDE            6.0        900000.0
1          ADELAIDE  NORTH ADELAIDE            6.0       1451000.0
2    ADELAIDE HILLS         ALDGATE           20.0        756000.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            2.0        619500.0
..              ...             ...            ...             ...
473    WEST TORRENS       THEBARTON            3.0        682000.0
474    WEST TORRENS    TORRENSVILLE           11.0        597500.0
475    WEST TORRENS       UNDERDALE            4.0        737500.0
476    WEST TORRENS      WEST BEACH           13.0        740000.0
477    WEST TORRENS   WEST RICHMOND            4.0        452500.0

[478 rows x 4 columns]

In [8]:
merged1 = pd.merge(refine1,refine2)
merged2 = pd.merge(refine3,refine4)
final = pd.merge(merged1,merged2)
final = final.dropna(how='any')
final

,City,Suburb,Sales Q3 2016,Median\n3Q 2016,Sales Q4 2016,Median Q4 2016,Sales Q1 2017,Median Q1 2017,Sales Q2 2017,Median Q2 2017
0,ADELAIDE,ADELAIDE,6.0,747500.0,6.0,683000.0,6.0,627500.0,6.0,900000.0
1,ADELAIDE,NORTH ADELAIDE,6.0,932000.0,6.0,1231000.0,6.0,992500.0,6.0,1451000.0
2,ADELAIDE HILLS,ALDGATE,13.0,665000.0,10.0,695000.0,14.0,695000.0,20.0,756000.0
5,ADELAIDE HILLS,BELAIR,8.0,605000.0,18.0,623000.0,18.0,700000.0,19.0,658250.0
7,ADELAIDE HILLS,BRIDGEWATER,16.0,536250.0,12.0,490500.0,18.0,435475.0,19.0,475000.0
...,...,...,...,...,...,...,...,...,...,...
472,WEST TORRENS,THEBARTON,2.0,516000.0,6.0,510000.0,3.0,568000.0,3.0,682000.0
473,WEST TORRENS,TORRENSVILLE,6.0,605000.0,10.0,588000.0,12.0,532000.0,11.0,597500.0
474,WEST TORRENS,UNDERDALE,6.0,521500.0,4.0,567500.0,5.0,540000.0,4.0,737500.0
475,WEST TORRENS,WEST BEACH,18.0,660000.0,11.0,575000.0,12.0,670000.0,13.0,740000.0
476,WEST TORRENS,WEST RICHMOND,2.0,468500.0,8.0,417500.0,2.0,419600.0,4.0,452500.0

In [9]:
# add a new column to hold medianprice for the year
new_col=[""]
final["y16_17_price"]=(final["Median\n3Q 2016"]+final["Median Q4 2016"]+final["Median Q1 2017"]+final["Median Q2 2017"])/4
final
y16_17_price=final
y16_17_price

#add new column to hold total sales for whole year
new_col=[""]
final["sales_16_17"]=(final["Sales Q3 2016"]+final["Sales Q4 2016"]+final["Sales Q1 2017"]+final["Sales Q2 2017"])
y19_20_price=final
y19_20_price

,City,Suburb,Sales Q3 2016,Median\n3Q 2016,Sales Q4 2016,Median Q4 2016,Sales Q1 2017,Median Q1 2017,Sales Q2 2017,Median Q2 2017,y16_17_price,sales_16_17
0,ADELAIDE,ADELAIDE,6.0,747500.0,6.0,683000.0,6.0,627500.0,6.0,900000.0,739500.00,24.0
1,ADELAIDE,NORTH ADELAIDE,6.0,932000.0,6.0,1231000.0,6.0,992500.0,6.0,1451000.0,1151625.00,24.0
2,ADELAIDE HILLS,ALDGATE,13.0,665000.0,10.0,695000.0,14.0,695000.0,20.0,756000.0,702750.00,57.0
5,ADELAIDE HILLS,BELAIR,8.0,605000.0,18.0,623000.0,18.0,700000.0,19.0,658250.0,646562.50,63.0
7,ADELAIDE HILLS,BRIDGEWATER,16.0,536250.0,12.0,490500.0,18.0,435475.0,19.0,475000.0,484306.25,65.0
...,...,...,...,...,...,...,...,...,...,...,...,...
472,WEST TORRENS,THEBARTON,2.0,516000.0,6.0,510000.0,3.0,568000.0,3.0,682000.0,569000.00,14.0
473,WEST TORRENS,TORRENSVILLE,6.0,605000.0,10.0,588000.0,12.0,532000.0,11.0,597500.0,580625.00,39.0
474,WEST TORRENS,UNDERDALE,6.0,521500.0,4.0,567500.0,5.0,540000.0,4.0,737500.0,591625.00,19.0
475,WEST TORRENS,WEST BEACH,18.0,660000.0,11.0,575000.0,12.0,670000.0,13.0,740000.0,661250.00,54.0
476,WEST TORRENS,WEST RICHMOND,2.0,468500.0,8.0,417500.0,2.0,419600.0,4.0,452500.0,439525.00,16.0

In [10]:
final.to_csv("y16_17_house.csv")

In [11]:
%store y16_17_price

Stored 'y16_17_price' (DataFrame)

In [12]:
# set up a new datafram to hold just suburb, sales count and median price for scatter plot
refined_Y1617=pd.DataFrame([y16_17_price.Suburb,y16_17_price.y16_17_price,y16_17_price.sales_16_17]).transpose()
refined_Y1617

             Suburb y16_17_price sales_16_17
0          ADELAIDE       739500          24
1    NORTH ADELAIDE  1.15162e+06          24
2           ALDGATE       702750          57
5            BELAIR       646562          63
7       BRIDGEWATER       484306          65
..              ...          ...         ...
472       THEBARTON       569000          14
473    TORRENSVILLE       580625          39
474       UNDERDALE       591625          19
475      WEST BEACH       661250          54
476   WEST RICHMOND       439525          16

[354 rows x 3 columns]

In [13]:
# sort by median price and retrieve just 10
bottom_10_price=refined_Y1617.sort_values(by=['y16_17_price'],ascending=True)
bottom_10_price=bottom_10_price.head(10)

# format price
bottom_10_price["y16_17_price"]=bottom_10_price["y16_17_price"].map("{:,}".format)

print(f"Bottom 10 ranking in median price Suburbs\n{bottom_10_price}\n")

Bottom 10 ranking in median price Suburbs
                Suburb y16_17_price sales_16_17
279       DAVOREN PARK    182,812.5          83
304  SMITHFIELD PLAINS    184,000.0          55
283    ELIZABETH DOWNS    199,375.0          67
286    ELIZABETH NORTH    200,125.0          38
284     ELIZABETH EAST    217,187.5          54
288    ELIZABETH SOUTH    217,375.0          34
285    ELIZABETH GROVE    218,937.5          23
287     ELIZABETH PARK    221,375.0          58
282          ELIZABETH    233,750.0          18
289     ELIZABETH VALE    239,000.0          57

In [14]:
# sort by median price and retrieve just 10
top_10_price=refined_Y1617.sort_values(by=['y16_17_price'],ascending=False)
top_10_price=top_10_price.head(10)

# format price
top_10_price["y16_17_price"]=top_10_price["y16_17_price"].map("{:,}".format)

print(f"Top 10 ranking in median price Suburbs\n{top_10_price}\n")

Top 10 ranking in median price Suburbs
          Suburb y16_17_price sales_16_17
445   UNLEY PARK  1,579,500.0          17
37       AULDANA  1,446,625.0          10
448     MEDINDIE  1,435,375.0          12
52      LEABROOK  1,433,125.0          16
102     TENNYSON  1,426,250.0          15
440      MALVERN  1,420,272.5          23
450  WALKERVILLE  1,420,000.0          42
217    ST PETERS  1,332,625.0          35
437    HYDE PARK  1,252,000.0          28
441    MILLSWOOD  1,224,375.0          20